9/data/attachments/cd2755488b6c2c3d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cc45c340-44e2-4cca-b933-4a428ae8bc28</nif:username>
            <nif:friendToBeAdded>Sarah_system_Friend_65396_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>